#+title: Lab 3
#+author: Ethan Coe-Renner

1. 
   1. $\frac{1}{3}*\frac{2}{3} * 2 = \frac{4}{9} = 0.\overline{4}$

   2. 

    #+begin_src R :exports both
      values=c(1,0)
      probs=c(2/3,1/3)

      propWins=replicate(1000,sum(sample(values,2,probs,replace=TRUE)))
      sum(propWins==1)/1000
    #+end_src

    #+RESULTS:
    : 0.449

    this result is close to the result from (a)

2. 

   1. for the mean to be greater than 80k, one must be 100k and the other either 80k or 100k.

      (80,100),(100,80),(100,100)

      $2 * \frac{1}{7} * \frac{3}{7} + \frac{3}{7}^2 = \frac{15}{49} \approx 0.306$

   2. 
    #+begin_src R :results output :exports both
      values=c(60,80,100)
      probs=c(3/7,1/7,3/7)

      propWins=replicate(1000,mean(sample(values,2,probs,replace=TRUE)))
      print(sum(propWins>80)/1000)

      propWins=replicate(100000,mean(sample(values,2,probs,replace=TRUE)))
      print(sum(propWins>80)/100000)
    #+end_src

    #+RESULTS:
    : [1] 0.318
    : [1] 0.30649

    result is close to result from (a), used N = 100000 in addition to N=1000
    because the rusults with 1000 had enough variance that it was difficult to confirm
    that 0.306 was right.
